Repository: eunhyekoo/glo_project
Catalog: feedback/TMData/[Naver] WEBTOON ID>EN Romance Punch.tmx
Source language: id
Languages: en

source: SAMA SEKALI
en: not recommended

source: YA, SEKARANG 1 APRIL,
en: yup, it’s april 1st.

source: TIAP HARI!
en: girl myself!

source: ITU JUGA BELUM TENTU, DIA GAK NGASIH JAWABAN PASTI…
en: we haven’t made any decision yet. he hasn’t given me a clear answer...

source: AKU MASIH MAU
en: do I

source: SIAL, INI APA-APAAN, DEH…
en: damn it, what is this...

source: KONDISI APA?
en: what condition?

source: NOLONGIN
en: how’s

source: MEMBANDINGKAN
en: do this...

source: GUA TADI NGASIH
en: I gave you

source: NAKAL!
en: one!

source: YANG TERJADI…
en: about everything..

source: SEKARANG GUA GAK MUNGKIN GAK SENYUM…
en: but I just can’t stop smiling right now.

source: SEBANYAK INI?!
en: has this kind of power?!

source: OH, YA.
en: Oh...

source: ULTAHKU AKA KAMU LUPA!
en: you don’t remember my birthday?!

source: DIUSIR DARI RUMAH
en: got kicked out of my house,

source: MEREKA DALAM
en: they’re

source: DAN GUA BAKAL JAGA DI LANTAI 2 KARENA GUA PENDEK!
en: and I’ll guard the second floor because I’m a shortie!

source: ALGOJO
en: executioner

source: TAPI ITU
en: but it

source: JANGAN--
en: don’t--

source: DI GUDANG.
en: earlier.

source: SEPERTI NINJA.
en: like freaking a ninja.

source: KAMU UDAH RAPI AJA!
en: so you’re ready to go?

source: MAKIN BEGO!
en: cut his hair!

source: GUA MAU
en: I want

source: BAGAIMANA?
en: the school?

source: HABIS NYIUM SEMBARANGAN…
en: (incorrect segments, translation moved to the missing text sheet)

source: KECOAK-KECOAK
en: just arrived

source: DI PINGGIR,
en: you know?!

source: SEMENTARA LEBIH DARI SETENGAH ANAK-ANAK INI ADALAH ORANG YANG BAKAL NGANCURIN SMA INI!
en: meanwhile, more than half of these people are the ones who will destroy this school!

source: GERBANG
en: to gate

source: KAMU LAGI KAYAK GINI NANTI DI JALAN KENAPA-NAPA.
en: (incorrect segments, translation moved to the missing text sheet)

source: GUA BUKAN
en: I’m not

source: KAMU TAHU KAN STATUS KITA SELAMA INI…
en: you understand our status, right?

source: ANDA DATANG…
en: Have you come here

source: KITA GAK BISA
en: I told you,

source: AAAA…
en: here we...

source: TADI ADA URUSAN
en: I had some unfinished business

source: GUA BISA MENGHABISI
en: I can finish

source: KUBERI PELAJARAN!
en: to be taught a lesson!

source: SI OMBAK HITAM,
en: the black wave,

source: SEBAIKNYA JANGAN
en: we shouldn’t

source: PADA
en: where

source: JAWAB
en: be

source: LU MAU
en: you want

source: MAU BERANTEM AKU GAK PEDULI!
en: (incorrect segments, translation moved to the missing text sheet)

source: AKU LUPA, INI
en: I forgot, this is

source: INTERNET SIH,
en: on the internet,

source: TANGANMU
en: what happened to

source: DUA BAGIAN TUBUH
en: him from

source: SEMUA INI
en: this is all

source: OM JAHAT
en: He’s the geezer

source: MEMUTIH…
en: white...

source: KONSEKUENSI DARI
en: the consequences of

source: JUST GO
en: let’s just go

source: DISKUSIKAN
en: the opportunity of

source: PILAR BESI LAIN
en: with the

source: RAHASIA KITA
en: weapon

source: HEI RAMBUT NORAK!!
en: Oi, blondie!

source: LU NGOMONG GITU
en: to come here alone

source: UH…
en: huh...

source: NAKAL!!
en: boys!

source: POS LU GIMANA, WOI!!
en: how about your post?!

source: TIDAK RELEVAN.
en: irrelevant,

source: KALAU ITU,
en: allow

source: DEKET ISTANA,
en: to pick up

source: IH NGOMONG APA DEH, INI SEMUA KAN IDEMU, AKU NGIKUTIN AJA!
en: what are you saying? all of this was your idea, I was just following your order!

source: SAMA BAROTO!
en: of me!

source: DARIMU,
en: a fighter.

source: DATANG
en: to

source: DIA KE
en: he’s going

source: AKU DAN NARA
en: Nara and I

source: GUA AJA CUKUP
en: enough

source: SUDAH DITUTUP,
en: all the exits,

source: DAN SUDAH KUKATAKAN,
en: I told you that

source: YAH,
en: okay,

source: AKU?
en: me?

source: LANGSUNG DARI STUDIO 2, PRESIDEN AKAN MENGKLARIFIKASI GOSIP YANG BEREDAR!
en: live from studio 2, the president is planning to clarify the widespread rumor!

source: KAMU NYIUM
en: Do you

source: ADIRA
en: Is

source: PROM UDAH KELAR, KAN?
en: the prom is over, right?

source: BERANI-BERANINYA
en: I can’t believe

source: SAYA BROJEK YANG SERING NENG TINDAS!!!
en: the driver who’s always been abandoned by you!

source: UNTUK ORANG YANG KATANYA GAK BISA DITEBAK, LO TERNYATA CUMAN BANYAK NGITUNG GAK JELAS!
en: for someone who’s “unpredictable,” you just like to babble about random things, huh?!

source: AWW!!
en: Ouch!

source: Nggak gitu!
en: that’s not what I meant!

source: PEMBAKARAN SEKOLAH!
en: we’ll burned down the school!

source: CIH,
en: Tsk...

source: BUAT LU!
en: for you!

source: MEMPERMAINKAN
en: dare you

source: ZAMAN KITE
en: our time

source: ANAK BAIK-BAIK,
en: look like

source: TAPI DIA SELALU LIHAT KAMU, LHO!
en: he’s always looking out for you, you know!

source: TAPI, BIAR
en: But,

source: BOSAN.
en: it.

source: ANAK BUAH ANDA?
en: your men?

source: HM, PUTRA?
en: huh, putra?

source: WOY, MAU KEMANA KALIAN?!
en: hey, where are you guys going?!

source: KARENA BIARIN DIA PERGI
en: letting her

source: LUMPUH ITU
en: if it was

source: SEBAGAI PRESIDEN
en: as the president,

source: ANAK MUDA
en: what a high-spirited

source: TOLONG
en: please

source: LAPANGAN MACHO.
en: brought to macho field.

source: AKU.
en: work.

source: DI SANA.
en: them too.

source: NARA,
en: Hang on,

source: MATI-MATI
en: you boys are still

source: GUNTING RAMBUT
en: after he

source: MAJU SINI GUA HAJAR!
en: I’ll beat you guys for good!

source: AMPE BERDARAH!
en: you just bit me!

source: OH YA NARA,
en: oh, nara

source: SIAPA?!
en: who?!

source: SI RATU JUGA
en: with

source: DIA BAHKAN
en: he even tried

source: KITA PERLU PLAN B!
en: we need a plan b!

source: AKU UDAH GAK PERLU INFO ITU LAGI, SEKOLAH INI SUDAH MENDINGAN DIBANDING DULU…
en: I don’t need that information anymore. this school has changed for the better now.

source: TAPI KATA KA' DAMAR
en: damar said her parents

source: BIANG KELADI
en: the mastermind

source: GAK GUNA NGOMONG SAMA MEREKA!
en: what a useless bunch!

source: MASIH PERCAYA
en: believe

source: DI TENGKORAK BESI.
en: iron skull.

source: URUSAN KITA BELUM SELESAI!
en: our business isn’t finished yet!

source: SAMA SEPERTI JATI, MASALAH KALIAN DENGAN KEKUATAN MENTAH YANG MELEDAK-LEDAK ADALAH PADA DELIVERY-NYA!
en: just like jati, you lack the finesse to use that raw strength of yours. it’s about the delivery!

source: DAN GAK PERLU MARAH-MARAH, KAN.
en: no need to be so hostile.

source: TENTU…
en: sure...

source: GUA!
en: cool intro!

source: NYARI
en: Can’t wait

source: KALAU PUTRA GAK KETEBAK, SIH…
en: I’m not sure about putra though...

source: JADI BEGITULAH…
en: so, yeah...

source: DIA?!
en: is he?!

source: BE…
en: Th-they

source: JELASKAN
en: enlighten

source: GUA AKUI TINJU GRANAT LU MEMANG BERBAHAYA, SAYANG SEKALI TIDAK DIDUKUNG DENGAN STAMINA LU.
en: I must admit that you’re grenade punches are dangerous. unfortunately, your stamina is lacking!

source: A…
en: I...

source: SYUKURLAH…
en: thank god...

source: INI
en: Is this their

source: BERUSAHA MENCARI
en: to get some

source: NGOMONG APA, SIH?
en: What are you talking about?!

source: TERIMA KASIH BANYAK
en: Thank you so much

source: PROMNYA BENTAR LAGI MULAI!
en: the prom will commence shortly!

source: MUNGKIN LAGI
en: they might be

source: BEDA!
en: totally different!

source: BERHATI-
en: Take care of yourselves,

source: CUMAN
en: you are a piece

source: PRESIDEN,
en: agents,

source: YA, SOAL MEREKA AKU BISA PERCAYA KE KAMU, SIH.
en: well, I think can take your word for it.

source: YA, IYA…
en: yes, it’s me.

source: DATANGKAN LANGSUNG
en: invited

source: SI PUTRA ABIS
en: he’s become a bigger fool

source: BISA TELAT BANGET
en: I’m gonna

source: MUNGKIN DIA GAK BISA LIHAT KE BAWAH KARENA KEHALANG PAGAR BERANDA.
en: Maybe he can’t see the venue from the second floor since the railings are too high for him.

source: MAMA CAPEK HIDUP DALAM RAHASIA…
en: I’m tired living in secret...

source: KITA LAGI NYARI AMEL JUGA, NIH!
en: we’ve been looking for amel too!

source: GAK NYANGKA
en: seeing this school on fire

source: IYA KAN, MEL?
en: Right, amel?

source: SETELAH
en: after she’d kicked you

source: EEH?
en: huh?

source: APA MAUMU?
en: what do you want?

source: BUTUH KALIAN.
en: bimbos anymore...

source: AKU BARU AJA
en: I just

source: JALAN PINTAS,
en: a

source: BELUM TERBAKAR.
en: burned the school.

source: GAK KAGET SIH, OTAK MEREKA CUMA SEGEDE KACANG.
en: I wouldn’t be surprised, those apes were brainless.

source: JADI KAMU BENERAN SEHARAN JUGA DI SINI?
en: so you’ve been guarding this place all day long?

source: INFORMASI INI KE AMEL,
en: this information to Amel,

source: OMOMG-OMONG AKU DAPET INFO BARU SOAL NARA PUTRA, LOH!
en: I’ve got some new information about nara and putra!

source: YANG MASIH TETAP
en: that’s been

source: SIAP…
en: roger that...

source: PADA MAU NONTON ORANG BERANTEM!
en: we’re going to watch a fight!

source: TAPI GUA SENDIRI JUGA MULAI BOSAN…
en: but, I’m starting to get bored too...

source: DIA UDAH
en: she’s

source: ADEGANNYE HARUS
en: we’ll have to

source: RAMBUT
en: anime

source: NARA GAK DI SINI ITU TANGGUNG JAWAB DIA SENDIRI, SEENGGAKNYA GUA PASTIIN DIAN--
en: nara is responsible for his own action, at least I can make sure that dian--

source: LU JAGO DAN GILA.
en: you’re insanely strong...

source: DIAN, KARENA LU MISKIN GUA TARO LU DI LAPANGAN MACHO, COCOK BUAT LU YANG KUMUH!
en: dian, since you’re poor, we’re going to put you at macho field, a suitable place for a hobo like you!

source: KAMU CERITAKAN.
en: you think.

source: PAMER
en: showing off,

source: ANAK HARAM?!
en: her in my life?

source: KALAU GUA NOLAK MEREKA BAKAL NYARI YANG LAIN, KAN?
en: if I refuse, they will just find someone else, right?

source: GAK PERCAYA…
en: didn’t want to believe me...

source: HEI, RATU?
en: hey, ratu?

source: INI ADIKNYA DIAN
en: what did they do

source: KALI?
en: huh?

source: BOLEH JUGA GENGGAMANMU!
en: heck of a grip there, boy!

source: MENJENGUK RATU,
en: on my way to visit ratu,

source: BARU AJA BALIK DARI SINGAPUR!
en: just got back from singapore!

source: PLANET…
en: he saying?

source: TENTU SAJA
en: of course

source: TAPI SEKALI LAGI MAKASIH KAMU LEBIH PERCAYA SAMA AKU DARIPADA PILAR BESI.
en: but, again, thanks for trusting me more than those pillars.

source: SUDAH SELESAI…
en: over...

source: BESOK UDAH APRIL AJE…
en: tomorrow is the 1st of april...

source: ALERGI KEKERASAN LU KAMBUH?
en: is your allergy acting up again?

source: AKU DITANGKAP
en: I got caught

source: HUUS
en: whoosh

source: KAMU BARENG
en: you were with

source: HAL LAIN?!
en: what thing?!

source: TAPI SETELAH SEHARIAN MENGHABISKAN WAKTU DENGAN PUTRA, AKU MENEMUKAN SATU POTONGAN PUZZLE YANG SELAMA INI HILANG...
en: fortunately, after spending a whole day with putra, I found the missing puzzle piece that we need....

source: SEMUANYA!
en: everyone!

source: KAMI AKAN
en: so, we will discuss

source: SENDIRIAN.
en: and say that.

source: ITU KARENA
en: You

source: JUSTRU INI
en: this is

source: GADIS DENGAN
en: a girl

source: SOAL LUKISAN.
en: a big deal for him.

source: NARA DICARI-CARI
en: beat up Nara,

source: SEKARANG LU NGEBUAT DIA MARAH!
en: and now you make him seriously angry!

source: ANAK SMA!
en: of cake!

source: LU LAMA BANGET,
en: what’s taking so long?!

source: LU MABUK, YA?
en: are you drunk?

source: LAGI RESEARCH PENTING!
en: I‘m doing some research!

source: GAK MAU KE SINI,
en: come...

source: KITA SUDAH DIKERJAIN!
en: we’ve been fooled!

source: HASH**T
en: achoo!

source: ENAK AJA!
en: I’m sorry!

source: UDANG!
en: chokehold!

source: DHOS
en: bam

source: MENGINCAR ANAK-ANAK
en: he’d been looking

source: RIBET!
en: very complicated!

source: PINTUNYA GAK DIKUNCI,
en: but, the door wasn’t locked,

source: LU YANG MAJU!
en: you come here!

source: KELUAR.
en: out.

source: AMEL DI MANA, YA?
en: where’s amel?

source: BENTAR
en: not so

source: KALAU GAK DITANYA
en: don’t speak

source: TAPI BISA TURUN DULU GAK…
en: could you please get down from there?

source: KAMU KADANG BAIK KADANG GAK JELAS, BIKIN BINGUNG…
en: you’re sweet sometimes, but you can be a jerk too. I’m confused...

source: GUA SEBENARNYA
en: I was hoping

source: SELALU BERLEBIHAN
en: has always gone the extra mile

source: KALAU GAK ADA KAMU DAN NIA, PROM INI GAK MUNGKIN JALAN.
en: if it weren’t for you and Nia, this prom wouldn’t have happened.

source: MAKANYA SELAMA INI GUA COBA BIKIN LO MARAH!
en: that’s why I’d been trying to get you angry!

source: SI TASLIM
en: I can’t believe

source: SHURIKEN.
en: his shurikens at me.

source: PROM -NYA
en: you

source: SOAL ADOPSI
en: adopting the child

source: IYA IYA, TAHU…
en: okay, okay, I believe you...

source: LO DATANG,
en: He’s gotten more stubborn

source: NIH LAHI, ABANG BROJEK KENCENG BANGET NYETIRNYA!
en: the driver is going too fast!

source: BAGAIMANA MUNGKIN
en: He’s

source: KEKUATAN TEKADNYA TIDAK TERBATAS!!
en: his willpower still won’t let him down!

source: KU URUS.
en: from here.

source: GUA NGERASA ADA ORANG DI SINI…
en: I can feel there’s someone here...

source: INI SODA YANG DIKIRIM ADIKKU DARI AMERIKA?
en: a soda my sister brought from the U.S!

source: UDAH BANTU GUA
en: for helping me

source: ADALAH
en: fight

source: SEKARANG, SOAL SEMUA
en: now, tell me

source: TENDANGAN PAYAHMU!
en: of that lame kick of yours!

source: OM BOTAK
en: the bald geezer is

source: USAHAMU
en: how much you try

source: KENAPA CUMA
en: another cockroach has

source: GUA SENDIRI
en: honestly,

source: KA-KATANYA INI SURPRISE?
en: I thought this was a surprise!

source: KAMU TAHU KONDISI KITA...
en: you understand our condition, right?

source: IH, MALAH NGALIHIN PEMBICARAAN!
en: don’t try to change the subject!

source: DAN WAKTU BERLALU…
en: and the night has come to an end...

source: HOI MUKA LU,
en: Oi...

source: SEMAKIN BANYAK…
en: coming...

source: GUNTINGNYA…
en: he cut his hair?

source: ANAK NAKAL…
en: on a bad boy like him!

source: NYEETT!!
en: huh?!

source: SEBANYAK INI
en: against

source: MAMA MOHON…
en: I beg you...

source: PADANYA…
en: in her...

source: OH IYA,
en: oh,

source: LAGIAN SEKOLAH
en: Plus, the school

source: RAMBUT OM
en: he still has

source: MASUK KAN
en: begging

source: EMANGNYA KALIAN
en: Are you really

source: ITU KETUKER…
en: the wrong message...

source: SEMOGA DIA
en: I hope

source: GAK PEDULI SOAL ITU,
en: doesn’t care about any of that anymore.

source: HAJAR ORANG-ORANG KAYA BELAGU ITU!!
en: let’s beat those cocky, rich boys!

source: YANG BAGUS
en: job,

source: MAU NYUSUL
en: want to

source: KUBERIKAN
en: I’m giving you

source: KEMAMPUANMU,
en: what you’ve got,

source: EH, SURPRISE UNTUK TEX?!
en: (incorrect segments, translation moved to the missing text sheet)

source: KETEMU ADIRA!
en: met adira!

source: 1000 KALI LIPAT!
en: one thousandfold!

source: JADI TOLONG KAMU JAGA KELAKUANMU.
en: so please, watch your manner.

source: KU KASIH RATING MINUS!
en: I’ll give him the worst rating possible!

source: TERIMA KASIH YA NAK AMEL, OKE, JADI PANTUNNYA GINI.
en: thank you, amel. okay, here we go.

source: DIA JAHAT,
en: she’s evil!

source: KAKAK SALAH PAHAM!
en: this is a misunderstanding!

source: A-APA YANG TERJADI?!
en: wh-what’s happening?

source: MENGADU DOMBA TEX DAN
en: fight each other.

source: GITU AJA?!
en: you’re going?!

source: TERKUNCI…
en: it’s locked!

source: HARUSNYE ANDA
en: you should’ve

source: HEI, SANTAI!
en: hey, calm down!

source: BAGIAN PANJAT
en: but not the climbing a tree

source: PROTOKOLNYA
en: the protocol was

source: HEI, JADI KAMU MAU IKUT ATAU NGGAK?!
en: hey, do you want to come or not?

source: TAPI, KONDISIMU
en: Oi, have you forgotten

source: ANJRIT!
en: you doofus!

source: KABARNYA DIA
en: I heard

source: LU BERDUA AHLI STRATEGINYA, KAN?
en: you two are known to be quite the strategist right?

source: ITU TANDA-TANDA
en: that’s what people do

source: TOLONG!
en: help!

source: DONG!
en: Damar?

source: SIAPA SIH
en: who is

source: AMEL KAN
en: She’s

source: TAHUN 1997!
en: in 1997!

source: BAHKAN HINGGA MASA PERSIAPAN MEREKA MENCOBA MENG-IMPRES CEWEK-CEWEK DENGAN MEMBANTU DEKORASI DAN ANGKAT MEJA, BEBERAPA YANG BEGO BAHKAN MENCOBA MEMAMERKAN OTOT DENGAN TOPLES.
en: Even during the prom preparation, these hungry boys are still trying hard to impress the girls by doing some decorations and lifting the tables. Some of them are so desperate, they’re walking around topless to show off their muscles.

source: WAJAHNYA.
en: a scar on his face.

source: KEMUDIAN
en: then,

source: DAN INGAT,
en: oh, and just so you know,

source: MABOK GULA, KAMU?
en: are you having a sugar rush?

source: PEMADAM KEBAKARAN!
en: the fire department!

source: BUAT GUA...
en: for me...

source: ANAK-ANAK
en: for you

source: BERHUBUNG KITA GAK DAPAT BANYAK INTEL, KITA MENGANDALKAN PERTAHANAN TRADISIONAL.
en: since we don’t have much intel, we’re going to use a conventional defensive strategy.

source: PINGSAN!
en: out!

source: LANJUTKAN KE TAHAP BERIKUTNYA!
en: move on to the next step!

source: RAMBUT BARU GUA?
en: about my new hair?

source: KAN…
en: right?

source: BERHARAP
en: that you boys

source: KATAMU
en: you said that

source: DULU DI DALAM BEH,
en: this place,

source: TAPI,
en: but,

source: TERSERAH, KALAUPUN ITU BENAR, AKU HARAP KALIAN MELAKUKANNYA DENGAN BENAR!
en: you do you. but, if that’s true, I hope you guys will do a good job!

source: BLACK CAMPAIGN
en: they’re the ones who

source: KALAU GITU LU JAGA DI HUTAN KARENA LU KAYAK TARZAN!
en: if that’s the case, you should guard the forest since you look like tarzan!

source: MENTANGTANGMU
en: to challenge you

source: MIKIR DULU BARU BERTINDAK!
en: You should’ve thought this through, damn you!

source: KATA ARTIKEL DI
en: according to some articles

source: Bukan gak mau, tanggal segitu aku bakal jagain sekolah juga, soal penyerangan itu!
en: I do want to come, but I need to guard the school at that time. we’re about to get attacked!

source: HAHA, GUA FREE LHO KALAU MAU DITEMENIN!
en: haha! I’m free if you need some company!

source: APA RENCANANYA?
en: what’s the plan?

source: INTI DARI SEMUA INI
en: Basically,

source: DI BUKU KEPO NIA…
en: nia showed me...

source: WALAUPUN MENJIJIKAN, PARA PANITIA MERASA SANGAT TERBANTU HINGGA UNTUK PERTAMA KALINYA SEKOLAH INI TERLIHAT CUKUP NORMAL.
en: while it’s unpleasant to look at, the prom committee is satisfied with their help. so, for the first time ever, the school seems to be quite “normal.”

source: AKU SEHARUSNYA
en: I should’ve

source: BIKIN GUA
en: is firing

source: DIA PERGI
en: she joined in

source: URIP
en: liripi

source: GAK MEMPAN!
en: wasn’t working!

source: TAPI ADA SATU HAL
en: but there’s one thing

source: BELUM BOLEH
en: go yet,

source: TAPI WAKTU GUA
en: when I

source: DAN MENYUSUL DAMAR!
en: her went to see damar!

source: DI HADAPANKU!
en: to see me again!

source: GAK TAHU DEH,
en: I don’t know,

source: MAKANYA…
en: so...

source: APAAN SIH?
en: Are being serious?!

source: MASIH DI SINI?
en: still here?

source: PEREMPUAN INI!!
en: this woman before!

source: BTW, KENAPA LU GAK MASUK?
en: by the way, aren’t you getting in?

source: LU NGANCURIN
en: You ruined

source: MENGHENTIKAN INI
en: to stop this

source: HUUU…
en: Huhuhu...

source: SEKARANG?!
en: Take that!

source: APA, SIH?
en: your problem?

source: DI ANIME…
en: win!

source: HATSHIH!
en: achoo

source: RILEKS…
en: relax now...

source: IH PARAH!
en: Oh my god!

source: NGAPAIN JUGA GUA NGAJAK MEREKA KE SINI?
en: why would I bring them here in the first place?

source: MASALAH
en: we need to stop

source: SEBELUMNYA MOHON MAAF BOS PUTRA!
en: excuse me boss!

source: TIDAK SEBURUK YANG
en: aren’t as bad as

source: BURUK?
en: horrible?

source: INTINYA, SOAL ITU
en: I honestly want to

source: SEPERTI INI.
en: meet like this.

source: BILANG AJA
en: I know

source: HARUS PERGI
en: got to get out of

source: YANG
en: You’ve got to be

source: BIJI SENDIRI!
en: your own pieces!

source: NGOBROLNYA NANTI DULU…
en: chit-chat later...

source: KATANYA
en: I thought

source: RATU, AKU
en: ratu, I still

source: TUJUH TITIK NAGA…
en: the seven dragons strike?!

source: DIAPAIN LAGI
en: to dian’s sister?!

source: KITA BERPISAH
en: we

source: SI RATU
en: ratu!

source: TUMBEN JALANAN
en: the street

source: UPS, SEPERTINYA
en: oops, let’s

source: BISA GUA
en: I can

source: ANEH DONG KALAU AKU LEBIH PERCAYA ANAK NAKAL DARIPADA KETUA OSIS.
en: it’d be odd if I trusted those thugs more than the student’s body president herself.

source: MULAI DARI HOAX
en: hoaxes and

source: MENGGANGGUKU.
en: bothering me.

source: NGANGGUR KAN?
en: you don’t have anything to do, right?

source: MUNCUL!
en: damar!

source: NONTON APE SIH, SERIUS AMET?
en: what are you looking at?

source: FLICK -KU
en: my technique was

source: KE-
en: wh-

source: BUAHKU.
en: subordinate.

source: KENAPA LU TERIMA NGISI BAND, SIH?!
en: how could you even perform at a time like this?!

source: GAK JUGA, GUA HITUNG SEMUA KEMUNGKINAN YANG ADA, TAPI GUA CUMA NGINCAR 1% SKENARIO YANG BAKAL TERJADI
en: not really. I’m good at calculating all possibilities. I’m just going to act based on a 1% chance.

source: KATANYA MAU BARENG!
en: I thought he wanted us to go together!

source: SENDIRI?
en: by myself?

source: DI ANTAH BERANTAH…
en: at some random place...

source: GAK ADA WAKTU,
en: don’t have much time!

source: AKU AKAN MENYUSUL
en: I’m going to catch up

source: DASAR
en: what a

source: KAMU GAK PIKIRIN
en: thought about

source: THAS
en: snap

source: KARENA DIA
en: Because

source: BERUBAH PIKIRAN!
en: before I change my mind!

source: UDAH DANDAN GINI NAIK BROJEK KAN JADI BELEPOTAN, MANA KA' DAMAR JUGA NGILANG…
en: riding a motorcycle like this will mess up my make up! Ugh... I couldn’t reach Damar either!

source: MANA
en: where’s

source: BIKIN KAMU
en: it makes you

source: DARI LU?
en: command, right?

source: SINGKAT CERITA,
en: long story short,

source: TE,AN-TEMAN LU PADA GAK GUNA, YA!
en: your friends are really useless!

source: NGUNGKIT-NGUNGKIT MASA LALU, NIH!
en: Oh, so bringing up old memories, are we?!

source: O-OKE…
en: o-okay...

source: MALU.
en: their claim.

source: KAU TIDAK PENASARAN SIAPA YANG NGIRIM?
en: didn’t you want to know who sent it?

source: YA IYALAH!
en: You think?!

source: BERUBAH…
en: gonna kill me...

source: KITA SELALU BERTEMU
en: how

source: BIAR GAK DIOMELIN
en: I don’t wanna piss

source: KUTUNGGU
en: I’m looking forward to your

source: SADAR GAK,
en: you

source: INI SUNGGUH KONYOL,
en: this is ridiculous...

source: NAMUN SELAMA INI SEMUANYA GAK ADA YANG BERGUNA.
en: that being said, none of those theories prove anything.

source: MEREKA, TAPI KENYATAANNYA
en: their business, but I

source: MAAFKAN IBU,
en: forgive me,

source: KALAJENGKING
en: scorpion

source: 1.000 TAHUN LAGI
en: need a thousand years of

source: NYEBELIN…
en: so annoying...

source: MEMBANTUKU.
en: me now.

source: RATU KAN OSIS,
en: she’s the student council president

source: AKHIRNYA
en: Finally...

source: EH, KAMU KOK TAHU?!
en: huh, how do you know about that?!

source: DIJEBAK
en: was

source: UDAH TELEPON
en: has called

source: DI LAIN WAKTU!!
en: again next time!

source: AKU AYAHNYA?
en: not my son! Not in a million years!

source: AKU BAHKAN UDAH BERAPA TAHUN GAK LIHAT ORANG ITU!
en: I haven’t even seen him in years!

source: TETAP SAMA
en: the same person

source: BAGUS TEX, BUAT DIAN TETAP MARAH, KITA PERLU TENAGANYA SEKARANG!
en: good job, tex! keep doing that, we need his strength!

source: INGAT MASA
en: of his

source: KAMU, KITA UDAH
en: we would be
